import React from 'react';
import { useParams } from 'react-router-dom';
import { faTooth } from '@fortawesome/free-solid-svg-icons';
import BookingButton from '../components/BookingButton/BookingButton';
import image from '../assets/services-dummy.avif'

const servicesDetails = {
    'زراعة الاسنان': {
        title: 'زراعة الاسنان',
        subtitle: 'حل دائم لاستعادة الابتسامة',
        description: 'زراعة الأسنان هي عملية جراحية متقدمة يتم من خلالها استبدال جذور الأسنان المفقودة أو التالفة بدعامات من التيتانيوم توضع داخل عظم الفك. بعد ذلك يتم تركيب أسنان صناعية تشبه الأسنان الطبيعية بشكل كبير. توفر زراعة الأسنان مظهرًا طبيعيًا وصلابة تمنح المريض القدرة على المضغ والابتسام بثقة كبيرة، بالإضافة إلى أنها تساعد في الحفاظ على صحة الفم وتمنع تدهور العظام نتيجة فقدان الأسنان.',
        icon: faTooth,
        color: '#ff6347',
    },
    'عمليات ضرس العقل': {
        title: 'عمليات ضرس العقل',
        subtitle: 'إجراء جراحي لتخفيف الألم والتزاحم',
        description: 'عملية إزالة ضرس العقل تعتبر من الإجراءات الجراحية الشائعة التي تهدف إلى التخلص من الضروس الخلفية التي غالبًا ما تسبب مشاكل صحية. في كثير من الحالات، لا تجد ضروس العقل مساحة كافية للنمو بشكل صحيح مما يؤدي إلى التهابات وألم وتزاحم الأسنان. يتم إجراء العملية تحت تأثير التخدير ويتم إزالة الضرس بشكل آمن لتجنب المضاعفات مثل التهاب اللثة أو إصابة الأسنان المجاورة.',
        icon: faTooth,
        color: '#4682b4',
    },
    'التقويم': {
        title: 'التقويم',
        subtitle: 'ابتسامة مثالية وصحية',
        description: 'تقويم الأسنان هو مجال متخصص في طب الأسنان يهدف إلى تصحيح الأسنان والفكين غير المتناسقين. باستخدام أدوات مثل الأقواس المعدنية أو الشفافة، يتم إعادة تنظيم الأسنان المتزاحمة أو البارزة لتتناسب بشكل مثالي مع بعضها البعض. لا يقتصر دور التقويم على الجماليات فقط، بل يساعد أيضًا في تحسين وظائف الفم مثل المضغ والنطق ويساهم في الوقاية من مشاكل اللثة والصداع المرتبط بسوء اصطفاف الفكين.',
        icon: faTooth,
        color: '#32cd32',
    },
    'الحشوات التجميلية': {
        title: 'الحشوات التجميلية',
        subtitle: 'استعادة المظهر الطبيعي للأسنان',
        description: 'الحشوات التجميلية تهدف إلى إصلاح الأسنان التي تعرضت للتسوس أو الكسر بطريقة تتماشى مع المظهر الطبيعي للأسنان. يتم استخدام مواد مثل الراتنج المركب أو البورسلين لتعبئة التجاويف أو الشقوق مع مراعاة اللون والشكل الطبيعي للأسنان المجاورة. تمنح الحشوات التجميلية المريض نتائج مبهرة تدوم طويلاً مع الحفاظ على صحة الفم وإعادة وظيفة الأسنان بشكل كامل.',
        icon: faTooth,
        color: '#ff4500',
    },
    'تنظيف الأسنان': {
        title: 'تنظيف الأسنان',
        subtitle: 'الحفاظ على صحة الفم واللثة',
        description: 'تنظيف الأسنان الدوري هو إجراء أساسي للحفاظ على صحة الفم والأسنان. خلال عملية التنظيف، يتم إزالة طبقات البلاك والجير التي تتراكم على الأسنان وتحت اللثة، والتي قد تؤدي إلى أمراض اللثة وتسوس الأسنان إذا لم يتم التخلص منها. إلى جانب تحسين مظهر الأسنان، يساعد التنظيف الاحترافي في منع تكون التسوس والتهابات اللثة ويساهم في تعزيز صحة الفم بشكل عام.',
        icon: faTooth,
        color: '#1e90ff',
    }
};



const ServicePage = () => {
    const { serviceName } = useParams();
    const service = servicesDetails[serviceName];

    if (!service) {
        return <h2>لم يتم العثور على الخدمة المطلوبة</h2>;
    }

    return (
        <div className="container text-right w-full">
                <img src={image} alt=""  className='w-full'/>
                <div className='px-4 mt-10 mx-auto'>
                    <h1 className="text-3xl text-primary font-bold ">{service.title}</h1>
                    <h2 className='text-sm text-black text-opacity-70 mt-2 mb-4'>{service.subtitle}</h2>
                    <p className="">{service.description}</p>
                </div>
            <div className='w-full flex justify-center mt-10 mb-20'>
                <BookingButton classes={'w-1/2'} />
            </div>
        </div>
    );
};

export default ServicePage;
